#language: ru
@Яндекс.Маркет.Наушники
Функционал: Яндекс.Маркет.Покупка

  Сценарий: Выбор наушников

    Когда Выбран на основной странице Яндекс пункт меню "Маркет"
    Когда Выполнено в Яндекс.Маркет нажатие на кнопку Электроника
    Когда Выполнено в меню Электроника нажатие на кнопку  "Наушники и Bluetooth-гарнитуры"
    Тогда Выполнено в выбранной категории товара нажатие на кнопку Все фильтры
    Когда Введена минимальная стоимость товара в размере  "5000"
    Когда Выбран производитель   "Beats"
    Тогда Выполнено нажатие на кнопку Показать подходящие
    Когда Количество элементов на странице выбрано в количестве "12"
    Тогда Выполнен поиск запомненного наименования первого элемента
    Тогда Выполнена проверка соответствия наименования заполненному значению

