#language: ru
@Яндекс.Маркет.Телевизоры
Функционал: Яндекс.Маркет.Покупка

  Сценарий: Выбор телевизоров

    Когда Выбран на основной странице Яндекс пункт меню "Маркет"
    Когда Выполнено в Яндекс.Маркет нажатие на кнопку Электроника
    Когда Выполнено в меню Электроника нажатие на кнопку  "Телевизоры"
    Тогда Выполнено в выбранной категории товара нажатие на кнопку Все фильтры
    Когда Введена минимальная стоимость товара в размере  "20000"
    Когда Выбран производитель   "Samsung"
    Когда Выбран производитель   "LG"
    Тогда Выполнено нажатие на кнопку Показать подходящие
    Когда Количество элементов на странице выбрано в количестве "12"
    Тогда Выполнен поиск запомненного наименования первого элемента
    Тогда Выполнена проверка соответствия наименования заполненному значению

